In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\310295192\\Desktop\\Python\\statistics'

In [4]:
df1 = pd.read_csv(r'C:\\Users\\310295192\\Desktop\\pandas\\first.csv')
df2 = pd.read_csv(r'C:\\Users\\310295192\\Desktop\\pandas\\second.csv')
df3 = pd.read_csv(r'C:\\Users\\310295192\\Desktop\\pandas\\third.csv')

In [5]:
df1

    A   B   C   D
0  a1  b1  c1  d1
1  a2  b2  c2  d2
2  a3  b3  c3  d3
3  a4  b4  c4  d4

In [7]:
row=pd.concat([df1,df2,df3])

In [8]:
row.shape

(12, 4)

In [9]:
col = pd.concat([df1,df2,df3],axis=1)

In [11]:
col['A']

    A   A    A
0  a1  a5   a9
1  a2  a6  a10
2  a3  a7  a11
3  a4  a8  a12

In [12]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df1.columns = ['A','B','C','D']
df2.columns = ['E','F','G','H']
df3.columns = ['A','C','F','H']

In [17]:
df2

    E   F   G   H
0  a5  b5  c5  d5
1  a6  b6  c6  d6
2  a7  b7  c7  d7
3  a8  b8  c8  d8

In [19]:
concated= pd.concat([df1,df2,df3])

C:\Users\310295192\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [21]:
concated.to_csv(r'C:\\Users\\310295192\\Desktop\\first.csv')

In [22]:
ls

 Volume in drive C is OSDisk
 Volume Serial Number is 021E-F987

 Directory of C:\Users\310295192\Desktop\Python\statistics

2019-05-05  19:54    <DIR>          .
2019-05-05  19:54    <DIR>          ..
2019-05-05  19:35    <DIR>          .ipynb_checkpoints
2019-05-05  19:54             9,479 combining_data.ipynb
2019-05-05  19:34           141,366 intro_to_pandas.ipynb
2019-04-27  14:37         8,990,464 statistics book.pdf
2019-04-27  14:41         2,392,163 thinkbayes.pdf
               4 File(s)     11,533,472 bytes
               3 Dir(s)  103,265,624,064 bytes free

In [23]:
concated

     A    B    C    D    E    F    G    H
0   a1   b1   c1   d1  NaN  NaN  NaN  NaN
1   a2   b2   c2   d2  NaN  NaN  NaN  NaN
2   a3   b3   c3   d3  NaN  NaN  NaN  NaN
3   a4   b4   c4   d4  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a5   b5   c5   d5
1  NaN  NaN  NaN  NaN   a6   b6   c6   d6
2  NaN  NaN  NaN  NaN   a7   b7   c7   d7
3  NaN  NaN  NaN  NaN   a8   b8   c8   d8
0   a9  NaN   b9  NaN  NaN   c9  NaN   d9
1  a10  NaN  b10  NaN  NaN  c10  NaN  d10
2  a11  NaN  b11  NaN  NaN  c11  NaN  d11
3  a12  NaN  b12  NaN  NaN  c12  NaN  d12

In [30]:
log1 = pd.read_csv(r'C:\\Users\\310295192\\Desktop\\merge\\log1.csv')
log2 = pd.read_csv(r'C:\\Users\\310295192\\Desktop\\merge\\log2.csv')
log3 = pd.read_csv(r'C:\\Users\\310295192\\Desktop\\merge\\log3.csv')

In [32]:
first_sec=log1.merge(log2,left_on='logger',right_on='log')

In [34]:
first_sec

  logger    name   log  age
0   Nam1  Maciej  Nam1   23
1   Nam2  Janosz  Nam2   43
2   Nam3    Olga  Nam3   21

In [37]:
first_sec.drop(['log'],axis=1)

  logger    name  age
0   Nam1  Maciej   23
1   Nam2  Janosz   43
2   Nam3    Olga   21